src/CFD/OpenFOAM/OpenFOAM-v2206-MUI/tutorials/multiphase/interFoam/laminar/damBreakPermeable/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

runApplication setFields

runApplication decomposePar

runParallel $(getApplication)

runParallel redistributePar -reconstruct -overwrite

#------------------------------------------------------------------------------
